# Taps
tap "d12frosted/emacs-plus"
tap "felixkratz/formulae"
tap "koekeishiya/formulae"
tap "shaunsingh/sfmono-nerd-font-ligaturized"
tap "oven-sh/bun"
tap "waydabber/betterdisplay"

# --- CLI Tools ---
brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "gnu-tar"
brew "gawk"
brew "grep"
brew "make"
brew "tree"
brew "wget"
brew "ripgrep"
brew "fzf"
brew "jq"
brew "zoxide"
brew "zsh-syntax-highlighting"
brew "yazi"
brew "fastfetch"
brew "tmux"
brew "git-delta"
brew "gh"
brew "uv"
brew "pipx"
brew "go"
brew "rust"
brew "nvm"
brew "cmake"
brew "automake"
brew "hugo"

# --- Emacs ---
# native-comp is built by default in emacs-plus@30 (no --with-native-comp flag);
# these are the exact args the main Mac was built with.
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-xwidgets", "with-imagemagick", "with-mailutils"]
brew "hunspell"
brew "mu"
brew "isync"
brew "offlineimap"
brew "ledger"
brew "pngpaste"
brew "poppler"
brew "libvterm"
brew "texinfo"
brew "wakatime-cli"
brew "pinentry-mac"

# --- macOS Window Management ---
brew "felixkratz/formulae/sketchybar"
brew "felixkratz/formulae/borders"
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"

# --- Monitor input/connection switching (scripts/monitor-mode.sh) ---
brew "m1ddc"                                  # DDC input switching
brew "waydabber/betterdisplay/betterdisplaycli"  # display connect/disconnect (app installed manually, Pro licensed)

# --- Media / Utils ---
brew "mpv"
brew "neovim"
brew "ollama"
brew "p7zip"
brew "sevenzip"
brew "unar"
brew "colima"
brew "docker"
brew "docker-compose"
brew "syncthing"
brew "clang-format"

# --- Fonts ---
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"        # terminal-tuned sans cut
cask "font-iosevka-term-slab-nerd-font"   # terminal-tuned slab-serif cut — Ghostty default
cask "font-jetbrains-mono-nerd-font"
cask "font-juliamono"
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-symbols-only-nerd-font"   # "Symbols Nerd Font Mono" — used by nerd-icons/doom-modeline

# --- GUI Apps ---
cask "ghostty"
cask "google-chrome"
cask "hammerspoon"
cask "localsend"
cask "alt-tab"
cask "linearmouse"
cask "raycast"
cask "tailscale-app"
cask "zed"
cask "gimp"
cask "inkscape"
cask "vlc"
cask "legcord"
cask "warp"
cask "mactex"
cask "miniforge"
cask "superwhisper"          # dictation with LLM reformatting

# --- Uncomment if needed ---
# cask "amethyst"              # tiling WM (you have yabai configs too)
# cask "db-browser-for-sqlite"
# cask "gcloud-cli"
# brew "cloud-sql-proxy"
# brew "postgresql@16"
# brew "jupyterlab"
# brew "protobuf"
# tap "heroku/brew"
# tap "qmk/qmk"
# tap "osx-cross/arm"
# tap "osx-cross/avr"
# tap "supabase/tap"
